Revit 2024 API
BuiltInFailures.RoomFailures.RoomsCreatedAutomatically Property
 [Room] [Room] created automatically.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomsCreatedAutomatically { get; }
Visual Basic
Public Shared ReadOnly Property RoomsCreatedAutomatically As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomsCreatedAutomatically {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace